// פונקצית המוצרים (בעתיד נשתמש במסדי נתונים)
function f_data(){
    let pictures = [
        // הרב נויגרשל
        { id: 0, code: "#240", name: "והשבות אל לבבך", price: 230, img: "../תמונות/נויגרשל/הרב נויגרשל והשבות.jpg", t: "נויגרשל" },
        { id: 1, code: "#241", name: "למה הם שונים", price: 200, img: "../תמונות/נויגרשל/הרב נויגרשל למה הם שונים.jpg", t: "נויגרשל" },
        { id: 2, code: "#242", name: "מחשבות והשקפות מבראשית", price: 250, img:"../תמונות/נויגרשל/הרב נויגרשל מחשבות.jpg", t: "נויגרשל" },
        { id: 3, code: "#243", name: "מסע אל פסגת הר סיני", price: 120, img: "../תמונות/נויגרשל/הרב נויגרשל מסע.jpg", t: "נויגרשל" },
        //הרב בידרמן
        { id: 4, code: "#340", name: "באר הפרשה", price: 170, img: "../תמונות/בידרמן/באר הפרשה.jpg", t: "בידרמן" },
        { id: 5, code: "#341", name: "הגדה", price: 150, img: "../תמונות/בידרמן/הגדה.jpg", t: "בידרמן" },
        { id: 6, code: "#342", name: "חנוכה", price: 190, img: "../תמונות/בידרמן/חנוכה.jpg", t: "בידרמן" },
        { id: 7, code: "#353", name: "פורים", price: 240, img: "../תמונות/בידרמן/פורים.jpg", t: "בידרמן" },
        //הרב ויא
        { id: 8, code: "#120", name: "בדיקת המזון", price: 220, img: "../תמונות/ויא/בדיקת המזון הרב ויא.jpg", t: "ויא" },
        { id: 9, code: "#121", name: "תרומות ומעשרות ", price: 270, img: "../תמונות/ויא/הרב ויא תרומ.jpg" , t: "ויא" },
        { id: 10, code: "#122", name: "קיצור בדיקת המזון", price: 140, img: "../תמונות/ויא/קיצור בדיקת המזון.jpg", t: "ויא" },
        // הרב רוזנבלום
        { id: 11, code: "#710", name: " הגדה", price: 240, img: "../תמונות/רוזנבלום/ברוך יאמרו הגדה.jpg", t: "רוזנבלום" },
        { id: 12, code: "#711", name: "ימים נוראים", price: 170, img: "../תמונות/רוזנבלום/הרב רוזנבלום ימים נוראים.jpg", t: "רוזנבלום" },
        { id: 13, code: "#712", name: " על התורה", price: 170, img: "../תמונות/רוזנבלום/הרב רוזנבלום נעימות.jpg", t: "רוזנבלום" },
        //הרב פינקוס
        { id: 14, code: "#510", name: "נפש שמשון - ימים נוראים", price: 500, img:"../תמונות/פינקוס/נפש שמשון ימם נוראים.jpg" , t: " פינקוס" },
        { id: 15, code: "#511", name: "נפש שמשון - פורים ", price: 270, img: "../תמונות/פינקוס/נפש שמשון פורים.jpg", t: " פינקוס" },
        { id: 16, code: "#513", name: "נפש חיה", price: 170, img: "../תמונות/פינקוס/נפש חיה.jpg", t: " פינקוס" },
        { id: 17, code: "#514", name: "נפש שמשון - אמונה", price: 165, img:"../תמונות/פינקוס/נפש שמשון אמונה.jpg" , t: " פינקוס" },
        { id: 18, code: "#515", name: "נפש שמשון - גלות ונחמה", price: 210, img: "../תמונות/פינקוס/נפש שמשון גלות ונחמה.jpg", t: " פינקוס" }, 
        { id: 19, code: "#512", name: "שערים בתפילה ", price: 270, img:"../תמונות/פינקוס/שערים בתפילה.jpg" , t: " פינקוס" },
        // הרב שלמה לוינשטין
            // על התורה
            { id: 20, code: "#611", name: "על התורה", price: 250, img: "../תמונות/לוינשטיין/ומתוק האור על התורה.jpg", t: "התורה" },
            // מועדים
            { id: 21, code: "#615", name: "איכה", price: 250, img: "../תמונות/לוינשטיין/מתוק האור איכה.jpg", t: " מועדים" },
            { id: 22, code: "#616", name: "הגדה", price: 250, img:"../תמונות/לוינשטיין/מתוק האור הגדה.jpg" , t: " מועדים" },
            { id: 23, code: "#617", name: "מגילה", price: 250, img: "../תמונות/לוינשטיין/מתוק האור מגילה.gif", t: " מועדים" },
            { id: 24, code: "#618", name: "שבת", price: 250, img: "../תמונות/לוינשטיין/מתוק האור שבת.jpg", t: " מועדים" },
            { id: 25, code: "#619", name: "ימים נוראים", price: 250, img: "../תמונות/לוינשטיין/מתוק האור ימים נוראים.jpg", t: " מועדים" },
            // גדולי הדורות
            { id: 26, code: "#612", name: "אברהם", price: 170, img: "../תמונות/לוינשטיין/מתוק האור אברהם.jpg", t: " גדולי" },
            { id: 27, code: "#613", name: "יצחק יעקב", price: 190, img: "../תמונות/לוינשטיין/מתוק האור יצחק יעקב.jpg", t: " גדולי" },
            { id: 28, code: "#614", name: "הגראיל ", price: 150, img: "../תמונות/לוינשטיין/מתוק_האור_הגראיל.jpg", t: " גדולי" },
    ]
    return pictures;
  }